#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x11C (0x99C - 0x880)
// BlueprintGeneratedClass BP_AGCharacter.BP_AGCharacter_C
class ABP_AGCharacter_C : public AAGCharacter
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x880(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                SheepMesh;                                         // 0x888(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                   SheepSpringArm;                                    // 0x890(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                      SheepCamera;                                       // 0x898(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                      PlayerInfoWidget;                                  // 0x8A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UObject*                               CurrentInteractable;                               // 0x8A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AGGameInstance_C*                  GameInstance;                                      // 0x8B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          CrouchHandle;                                      // 0x8B8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ShopSphere_C*                      ShopActor;                                         // 0x8C0(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                         IsShopOpen_;                                       // 0x8C8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                        Pad_1426[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAsyncTaskOwnedTagChanged*             ListenForMoveToGATag;                              // 0x8D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        RandomZAxisValue;                                  // 0x8D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1427[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAbilitySystemComponent*               ASC;                                               // 0x8E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AGCharacter_C*                     Teammate;                                          // 0x8E8(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FearDamageThreshold;                               // 0x8F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PlayChargingAnim;                                  // 0x8F4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1429[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FearWalkDuration;                                  // 0x8F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_142A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAsyncTaskWalkInDirection*             WalkInDirectionAndWaitAsyncTask;                   // 0x900(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MaxAccelerationDelta;                              // 0x908(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsVanishedd;                                       // 0x90C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_142B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GameplayCueCount;                                  // 0x910(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CameraDefaultLoc;                                  // 0x914(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>            Cached3PMeshMaterials;                             // 0x920(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>            Cached1PMeshMaterials;                             // 0x930(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>            CachedWeapon1PMeshMaterials;                       // 0x940(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>            CachedWeapon3PMeshMaterials;                       // 0x950(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class USkeletalMesh*                         CharacterMesh;                                     // 0x960(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                CharacterAnimClass;                                // 0x968(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        PlayerInfoWidgetHeightDelta;                       // 0x970(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_142C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastInlineDelegateProperty_            OnCharacterMeshVisibilityChanged;                  // 0x978(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                        BladeStormRange;                                   // 0x988(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasBladeStormActive;                               // 0x98C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_142D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BladeStormTickRate;                                // 0x990(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bDoesFearWalk;                                     // 0x994(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_142E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FearTagCount;                                      // 0x998(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_AGCharacter_C* GetDefaultObj();

	void CheckAndSetupBladeStormCachables(enum class EEvaluateCurveTableResult CallFunc_EvaluateCurveTableRow_OutResult, float CallFunc_EvaluateCurveTableRow_OutXY, bool CallFunc_LessEqual_FloatFloat_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, enum class EEvaluateCurveTableResult CallFunc_EvaluateCurveTableRow_OutResult_1, float CallFunc_EvaluateCurveTableRow_OutXY_1, float CallFunc_Multiply_FloatFloat_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1);
	void TransformCharacter(bool ToSheep_, enum class ECollisionResponse Temp_byte_Variable, bool CallFunc_Not_PreBool_ReturnValue, enum class ECollisionResponse Temp_byte_Variable_1, int32 Temp_int_Array_Index_Variable, bool Temp_bool_Variable, enum class ECollisionResponse K2Node_Select_Default, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, enum class ECollisionResponse Temp_byte_Variable_2, enum class ECollisionResponse Temp_byte_Variable_3, bool Temp_bool_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, enum class ECollisionResponse K2Node_Select_Default_1, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<class UFXSystemComponent*>& CallFunc_K2_GetComponentsByClass_ReturnValue, class UFXSystemComponent* CallFunc_Array_Get_Item, class UActorComponent* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, float Temp_float_Variable, bool Temp_bool_Variable_2, float K2Node_Select_Default_2, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FHitResult& CallFunc_K2_SetRelativeLocation_SweepHitResult, bool CallFunc_IsLocallyControlled_ReturnValue);
	void CheckThornsGE(class UAGAbilitySystemComponent* SourceASC, const struct FGameplayTagContainer& GEAssetTags, bool CallFunc_HasTag_ReturnValue, int32 CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue, const struct FGameplayEffectContextHandle& CallFunc_MakeEffectContext_ReturnValue, int32 CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_1, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1, bool CallFunc_HasMatchingGameplayTag_ReturnValue_1, const struct FGameplayEffectContextHandle& CallFunc_MakeEffectContext_ReturnValue_1, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1);
	void CheckFearGE(float MitigatedDamage, bool CallFunc_LessEqual_FloatFloat_ReturnValue, class UAGAbilitySystemComponent* K2Node_DynamicCast_AsAGAbility_System_Component, bool K2Node_DynamicCast_bSuccess, float CallFunc_Subtract_FloatFloat_ReturnValue, int32 CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue);
	void Check_Double_Strikes(float MitigatedDamage, class UAGAbilitySystemComponent* SourceASC, struct FGameplayTagContainer& GEAssetTags, enum class EEvaluateCurveTableResult CallFunc_EvaluateCurveTableRow_OutResult, float CallFunc_EvaluateCurveTableRow_OutXY, bool CallFunc_HasTag_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess, const struct FGameplayEffectContextHandle& CallFunc_MakeEffectContext_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, const struct FGameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FGameplayEffectSpecHandle& CallFunc_AssignTagSetByCallerMagnitude_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue);
	void Check_Voodoo_GE(float MitigatedDamage, class UAGAbilitySystemComponent* SourceASC, struct FGameplayTagContainer& GEAssetTags, enum class EEvaluateCurveTableResult CallFunc_EvaluateCurveTableRow_OutResult, float CallFunc_EvaluateCurveTableRow_OutXY, bool CallFunc_HasTag_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, const struct FGameplayEffectContextHandle& CallFunc_MakeEffectContext_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, const struct FGameplayEffectSpecHandle& CallFunc_MakeOutgoingSpec_ReturnValue, const struct FGameplayEffectSpecHandle& CallFunc_AssignTagSetByCallerMagnitude_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue);
	void OnRep_IsShopOpen_(bool CallFunc_IsLocallyControlled_ReturnValue, class AController* CallFunc_GetController_ReturnValue, class ABP_AGPlayerController_C* K2Node_DynamicCast_AsBP_AGPlayer_Controller, bool K2Node_DynamicCast_bSuccess);
	void OnRep_ShopActor(bool Temp_bool_Variable, class FText Temp_text_Variable, class FText Temp_text_Variable_1, class AController* CallFunc_GetController_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue, class ABP_AGPlayerController_C* K2Node_DynamicCast_AsBP_AGPlayer_Controller, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, class FText K2Node_Select_Default);
	void CheckTarget(class ABP_AGCharacter_C* ViewedPawn);
	void UserConstructionScript(TArray<class UMaterialInterface*>& CallFunc_GetMaterials_ReturnValue, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, TArray<class UMaterialInterface*>& CallFunc_GetMaterials_ReturnValue_1, TArray<class UMaterialInterface*>& CallFunc_GetMaterials_ReturnValue_2, TArray<class UMaterialInterface*>& CallFunc_GetMaterials_ReturnValue_3, float CallFunc_GetMaxAcceleration_ReturnValue);
	void OnWalkDurationEnded_838EB2624758B39CE502B0902B84DDA5();
	void InpActEvt_Chat_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_GlobalChat_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_TeamChat_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_OpenShop_K2Node_InputActionEvent_0(const struct FKey& Key);
	void OnOwnedTagChanged_5045B434458AD3342FE0E28A8E50A74A(const struct FGameplayTag& OwningTag, int32 Amount);
	void OnWalkDurationEnded_5B25C4B5425B83A7551F9B8154A928F7();
	void OnNotifyEnd_FCB6966347A9D5B8B4E78184124B6512(class FName NotifyName);
	void OnNotifyBegin_FCB6966347A9D5B8B4E78184124B6512(class FName NotifyName);
	void OnInterrupted_FCB6966347A9D5B8B4E78184124B6512(class FName NotifyName);
	void OnBlendOut_FCB6966347A9D5B8B4E78184124B6512(class FName NotifyName);
	void OnCompleted_FCB6966347A9D5B8B4E78184124B6512(class FName NotifyName);
	void OnIceBlockTagChanged(int32 Amount);
	void ToggleFreezePlayer(bool ShouldFreeze);
	void OnStunTagChanged(int32 Amount);
	void OnFearTagChanged(int32 Amount);
	void OnRootTagChanged(int32 Amount);
	void Client_WalkDiagonal();
	void Client_StopDiagonalWalk();
	void Multicast_OnSheepTagChanged(int32 Amount);
	void OnBladeStormTagChanged(int32 Amount);
	void ReceiveBeginPlay();
	void BPSendInfoToKillFeed(class AController* KillerPC, class AAGCharacter* DeadActor);
	void ShowGameplayUI(class APlayerController* Controller);
	void ReceivePossessed(class AController* NewController);
	void BPShowHitIndicator(struct FVector& DamagerLocation);
	void Server_Open_Shop();
	void Close_Shop();
	void Server_Close_Shop();
	void CheatOpenShop();
	void Server_CheatGold(int32 Gold);
	void CheatGold(int32 Gold);
	void SimulatedProxies_SetVanishVisibility(bool IsVisible);
	void SetVisibility(bool IsVisible);
	void Multicast_SetVisibility(bool IsVisible);
	void Server_RemoveGameplayCueDelay(float Time, const struct FGameplayTag& GameplayCueTag);
	void BPOnDeath(class AAGPlayerState* Killer);
	void OnAbilitySystemComponentInitialized(class UAbilitySystemComponent* AbilitySystemComponent);
	void ReceivedDamage(class UAGAbilitySystemComponent* SourceASC, float MitigatedDamage, const struct FGameplayTagContainer& GEAssetTags);
	void Client_ChargeWalkToDestination(float Duration, const struct FVector& WorldDirection, float MaxAcceleration);
	void Server_SetMaxAcceleration(float MaxAcceleration);
	void OnLanded(struct FHitResult& Hit);
	void OnJumped();
	void SetupPlayerCard();
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
	void ExecuteUbergraph_BP_AGCharacter(int32 EntryPoint, int32 Temp_int_Variable, class FName K2Node_CustomEvent_NotifyName, class FName Temp_name_Variable, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 K2Node_CustomEvent_Amount_5, bool CallFunc_Greater_IntInt_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Variable_1, bool K2Node_CustomEvent_ShouldFreeze, class AController* CallFunc_GetController_ReturnValue, class APlayerController* K2Node_DynamicCast_AsPlayer_Controller, bool K2Node_DynamicCast_bSuccess, class AController* CallFunc_GetController_ReturnValue_1, int32 K2Node_CustomEvent_Amount_4, class APlayerController* K2Node_DynamicCast_AsPlayer_Controller_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_Greater_IntInt_ReturnValue_1, int32 K2Node_CustomEvent_Amount_3, int32 K2Node_CustomEvent_Amount_2, bool CallFunc_Greater_IntInt_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue_3, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 K2Node_CustomEvent_Amount_1, bool CallFunc_Greater_IntInt_ReturnValue_4, int32 K2Node_CustomEvent_Amount, TArray<enum class EObjectTypeQuery>& K2Node_MakeArray_Array, bool CallFunc_Greater_IntInt_ReturnValue_5, TArray<class AActor*>& K2Node_MakeArray_Array_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, TArray<class AActor*>& CallFunc_SphereOverlapActors_OutActors, bool CallFunc_SphereOverlapActors_ReturnValue, const struct FGameplayEffectContextHandle& CallFunc_MakeEffectContext_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable_2, class AActor* CallFunc_Array_Get_Item, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue, enum class EEvaluateCurveTableResult CallFunc_EvaluateCurveTableRow_OutResult, float CallFunc_EvaluateCurveTableRow_OutXY, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_RandomBool_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FVector& CallFunc_RotateAngleAxis_ReturnValue, class UAsyncTaskWalkInDirection* CallFunc_WalkInDirectionAndWait_ReturnValue, class FName K2Node_CustomEvent_NotifyName_1, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, int32 Temp_int_Loop_Counter_Variable_1, class FName K2Node_CustomEvent_NotifyName_2, int32 CallFunc_Add_IntInt_ReturnValue_1, class APlayerController* CallFunc_GetPlayerController_ReturnValue, bool Temp_bool_Variable, class ABP_AGPlayerController_C* K2Node_DynamicCast_AsBP_AGPlayer_Controller, bool K2Node_DynamicCast_bSuccess_2, int32 K2Node_Select_Default, float CallFunc_Conv_IntToFloat_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class FName K2Node_CustomEvent_NotifyName_3, int32 Temp_int_Loop_Counter_Variable_2, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class AController* K2Node_Event_KillerPC, class AAGCharacter* K2Node_Event_DeadActor, class AController* CallFunc_GetController_ReturnValue_2, class ABP_AGPlayerController_C* K2Node_DynamicCast_AsBP_AGPlayer_Controller_1, bool K2Node_DynamicCast_bSuccess_3, class ABP_AGPlayerController_C* K2Node_DynamicCast_AsBP_AGPlayer_Controller_2, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_IsRedTeam_ReturnValue, bool CallFunc_IsRedTeam_ReturnValue_1, class FText CallFunc_GetPlayerName_ReturnValue, class FText CallFunc_GetPlayerName_ReturnValue_1, class APlayerController* K2Node_CustomEvent_Controller, class AController* K2Node_Event_NewController, class ABP_AGPlayerController_C* K2Node_DynamicCast_AsBP_AGPlayer_Controller_3, bool K2Node_DynamicCast_bSuccess_5, class APlayerController* K2Node_DynamicCast_AsPlayer_Controller_2, bool K2Node_DynamicCast_bSuccess_6, class ABP_AGPlayerController_C* K2Node_DynamicCast_AsBP_AGPlayer_Controller_4, bool K2Node_DynamicCast_bSuccess_7, bool CallFunc_IsValid_ReturnValue_2, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, class FName K2Node_CustomEvent_NotifyName_4, class ABP_AGPlayerController_C* K2Node_DynamicCast_AsBP_AGPlayer_Controller_5, bool K2Node_DynamicCast_bSuccess_8, const struct FVector& K2Node_Event_DamagerLocation, bool CallFunc_IsValid_ReturnValue_3, int32 K2Node_CustomEvent_Gold, class AAGPlayerState* K2Node_DynamicCast_AsAGPlayer_State, bool K2Node_DynamicCast_bSuccess_9, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, int32 K2Node_Event_Gold, bool K2Node_CustomEvent_IsVisible_2, bool CallFunc_Not_PreBool_ReturnValue, bool K2Node_CustomEvent_IsVisible_1, bool K2Node_CustomEvent_IsVisible, float K2Node_CustomEvent_Time, const struct FGameplayTag& K2Node_CustomEvent_GameplayCueTag, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_1, bool CallFunc_Greater_FloatFloat_ReturnValue, class UAGAbilitySystemComponent* K2Node_DynamicCast_AsAGAbility_System_Component, bool K2Node_DynamicCast_bSuccess_10, class AController* CallFunc_GetController_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, class UUserWidget* CallFunc_GetUserWidgetObject_ReturnValue, class UWB_PlayerStats_Overhead_C* K2Node_DynamicCast_AsWB_Player_Stats_Overhead, bool K2Node_DynamicCast_bSuccess_11, class AAGPlayerState* K2Node_Event_Killer, class ABP_AGPlayerState_C* K2Node_DynamicCast_AsBP_AGPlayer_State, bool K2Node_DynamicCast_bSuccess_12, bool CallFunc_IsRedTeam_ReturnValue_2, const class FString& CallFunc_GetPlayerName_ReturnValue_2, class FText CallFunc_Conv_StringToText_ReturnValue, bool CallFunc_IsValid_ReturnValue_5, class AController* CallFunc_GetController_ReturnValue_4, class ABP_AGPlayerController_C* K2Node_DynamicCast_AsBP_AGPlayer_Controller_6, bool K2Node_DynamicCast_bSuccess_13, bool CallFunc_IsRedTeam_ReturnValue_3, const class FString& CallFunc_GetPlayerName_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_6, class FText CallFunc_Conv_StringToText_ReturnValue_1, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, class UAbilitySystemComponent* K2Node_CustomEvent_AbilitySystemComponent, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, class UAGAbilitySystemComponent* K2Node_CustomEvent_SourceASC, float K2Node_CustomEvent_MitigatedDamage, const struct FGameplayTagContainer& K2Node_CustomEvent_GEAssetTags, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, bool CallFunc_Greater_FloatFloat_ReturnValue_1, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, TArray<class ABP_AGCharacter_BlueTeam_C*>& CallFunc_GetAllActorsOfClass_OutActors, TArray<class ABP_AGCharacter_RedTeam_C*>& CallFunc_GetAllActorsOfClass_OutActors_1, class ABP_AGCharacter_BlueTeam_C* CallFunc_Array_Get_Item_1, class ABP_AGCharacter_RedTeam_C* CallFunc_Array_Get_Item_2, class ABP_AGCharacter_RedTeam_C* CallFunc_Array_Get_Item_3, class ABP_AGCharacter_RedTeam_C* CallFunc_Array_Get_Item_4, class ABP_AGCharacter_BlueTeam_C* CallFunc_Array_Get_Item_5, class ABP_AGCharacter_BlueTeam_C* CallFunc_Array_Get_Item_6, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, const struct FGameplayTag& Temp_struct_Variable, class UAsyncTaskOwnedTagChanged* CallFunc_ListenForOwnedTagChange_ReturnValue, bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess, bool CallFunc_IsValid_ReturnValue_7, class UAGAbilitySystemComponent* K2Node_DynamicCast_AsAGAbility_System_Component_1, bool K2Node_DynamicCast_bSuccess_14, int32 Temp_int_Variable_2, const struct FGameplayTag& K2Node_CustomEvent_OwningTag, int32 K2Node_CustomEvent_Amount_6, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, bool CallFunc_IsRedTeam_ReturnValue_4, bool CallFunc_IsLocallyControlled_ReturnValue, bool CallFunc_IsValid_ReturnValue_8, enum class ENetRole CallFunc_GetLocalRole_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, float K2Node_CustomEvent_Duration, const struct FVector& K2Node_CustomEvent_WorldDirection, float K2Node_CustomEvent_MaxAcceleration_1, class UAsyncTaskWalkInDirection* CallFunc_WalkInDirectionAndWait_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_9, const struct FKey& K2Node_InputActionEvent_Key, float K2Node_CustomEvent_MaxAcceleration, float CallFunc_GetScaledCapsuleHalfHeight_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FHitResult& K2Node_Event_Hit, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, const struct FVector& CallFunc_MakeVector_ReturnValue_1, bool CallFunc_Greater_FloatFloat_ReturnValue_2, float CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_1, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_1, float CallFunc_BreakVector_X_2, float CallFunc_BreakVector_Y_2, float CallFunc_BreakVector_Z_2, float CallFunc_Subtract_FloatFloat_ReturnValue_1, class UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_10, float K2Node_Event_HalfHeightAdjust_1, float K2Node_Event_ScaledHalfHeightAdjust_1, float K2Node_Event_HalfHeightAdjust, float K2Node_Event_ScaledHalfHeightAdjust, bool CallFunc_IsLocallyControlled_ReturnValue_1, const struct FRotator& CallFunc_MakeRotator_ReturnValue, TArray<class UFXSystemComponent*>& CallFunc_K2_GetComponentsByClass_ReturnValue, const struct FKey& K2Node_InputActionEvent_Key_1, class UFXSystemComponent* CallFunc_Array_Get_Item_7, class UActorComponent* CallFunc_Array_Get_Item_8, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_3, const struct FKey& K2Node_InputActionEvent_Key_2, const struct FKey& K2Node_InputActionEvent_Key_3, int32 CallFunc_RemoveActiveEffectsWithTags_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void OnCharacterMeshVisibilityChanged__DelegateSignature(bool IsVisible);
};

}


