#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xA8 (0x2D8 - 0x230)
// WidgetBlueprintGeneratedClass WB_ActionBar.WB_ActionBar_C
class UWB_ActionBar_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x230(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                        ActionBarBox;                                      // 0x238(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ActionBarSlot_C*                   WB_ActionBarSlot;                                  // 0x240(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ActionBarSlot_C*                   WB_ActionBarSlot_1;                                // 0x248(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ActionBarSlot_C*                   WB_ActionBarSlot_2;                                // 0x250(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ActionBarSlot_C*                   WB_ActionBarSlot_3;                                // 0x258(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ActionBarSlot_C*                   WB_ActionBarSlot_4;                                // 0x260(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ActionBarSlot_C*                   WB_ActionBarSlot_5;                                // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ActionBarSlot_C*                   WB_ActionBarSlot_6;                                // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<enum class EAGAbilityInputID, struct FStruct_ActionBarSlotAbilityInfo> ActionBarSlots;                                    // 0x278(0x50)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)
	class UWB_Gameplay_C*                        HUD;                                               // 0x2C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAGAbilitySystemComponent*             OwnerASC;                                          // 0x2D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWB_ActionBar_C* GetDefaultObj();

	void CheckAbilityActivationStatus(const struct FGameplayTag& InOwningTag, enum class EAGAbilityInputID InAbilityInput, struct FStruct_ActionBarSlotAbilityInfo& InActionBarSlotAbilityInfo, int32 InCount, const struct FGameplayTagContainer& TempGameplayTagContainer, int32 OwningTagCount, const struct FStruct_ActionBarSlotAbilityInfo& ActionBarSlotAbilityInfo, const struct FGameplayTag& OwningTag, enum class EAGAbilityInputID AbilityInput, const struct FStruct_ActionBarSlotAbilityInfo& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, TArray<struct FGameplayTag>& CallFunc_BreakGameplayTagContainer_GameplayTags, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, bool CallFunc_RemoveGameplayTag_ReturnValue, const struct FGameplayTagContainer& CallFunc_MakeLiteralGameplayTagContainer_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, const struct FStruct_ActionBarSlotAbilityInfo& CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, const class FString& CallFunc_GetDebugStringFromGameplayTagContainer_ReturnValue, const struct FGameplayAbilitySpec& CallFunc_BP_FindAbilitySpecFromClass_ReturnValue, const struct FGameplayTagContainer& CallFunc_GetAbilityActivationBlockedTags_ReturnValue, bool CallFunc_HasTag_ReturnValue, const struct FStruct_ActionBarSlotAbilityInfo& CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2);
	void OnOwnedTagChanged_D84337954CD10C215BAB2A89C4B2221E(const struct FGameplayTag& OwningTag, int32 Amount);
	void Construct();
	void On_Ability_Added(class UAbilitySystemComponent* AbilitySystemComponent, class UClass* GameplayAbilityClass, enum class EAGAbilityInputID InputID);
	void Wait_for_Valid_Data();
	void ListenForAbilitiesBeingBlocked();
	void ListenForAbilitiesBeingUsed();
	void OnLocalAbilityInputPressed(enum class EAGAbilityInputID AbilityInputID);
	void ExecuteUbergraph_WB_ActionBar(int32 EntryPoint, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Array_Index_Variable_2, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_3, class UAbilitySystemComponent* K2Node_CustomEvent_AbilitySystemComponent, class UClass* K2Node_CustomEvent_GameplayAbilityClass, enum class EAGAbilityInputID K2Node_CustomEvent_InputID, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UWB_ActionBarSlot_C* K2Node_DynamicCast_AsWB_Action_Bar_Slot, bool K2Node_DynamicCast_bSuccess, const struct FStruct_ActionBarSlotAbilityInfo& K2Node_MakeStruct_Struct_ActionBarSlotAbilityInfo, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class ABP_AGPlayerState_C* K2Node_DynamicCast_AsBP_AGPlayer_State, bool K2Node_DynamicCast_bSuccess_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, TArray<enum class EAGAbilityInputID>& CallFunc_Map_Keys_Keys, bool CallFunc_IsValid_ReturnValue, enum class EAGAbilityInputID CallFunc_Array_Get_Item_1, const struct FStruct_ActionBarSlotAbilityInfo& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UClass* CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_1, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_2, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, TArray<struct FStruct_ActionBarSlotAbilityInfo>& CallFunc_Map_Values_Values, int32 Temp_int_Loop_Counter_Variable_3, const struct FStruct_ActionBarSlotAbilityInfo& CallFunc_Array_Get_Item_2, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 CallFunc_Array_Length_ReturnValue_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_1, class UAsyncTaskOwnedTagChanged* CallFunc_ListenForOwnedTagChange_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_3, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, class UAGAbilitySystemComponent* K2Node_DynamicCast_AsAGAbility_System_Component, bool K2Node_DynamicCast_bSuccess_2, enum class EAGAbilityInputID K2Node_CustomEvent_AbilityInputID, const struct FStruct_ActionBarSlotAbilityInfo& CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, const struct FStruct_ActionBarSlotAbilityInfo& K2Node_SetFieldsInStruct_StructOut, TArray<enum class EAGAbilityInputID>& CallFunc_Map_Keys_Keys_1, enum class EAGAbilityInputID CallFunc_Array_Get_Item_3, const struct FStruct_ActionBarSlotAbilityInfo& CallFunc_Map_Find_Value_3, bool CallFunc_Map_Find_ReturnValue_3, const struct FStruct_ActionBarSlotAbilityInfo& CallFunc_Map_Find_Value_4, bool CallFunc_Map_Find_ReturnValue_4, const struct FStruct_ActionBarSlotAbilityInfo& K2Node_SetFieldsInStruct_StructOut_1, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_3, const struct FStruct_ActionBarSlotAbilityInfo& CallFunc_Map_Find_Value_5, bool CallFunc_Map_Find_ReturnValue_5, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_4, TArray<struct FGameplayTag>& CallFunc_BreakGameplayTagContainer_GameplayTags, int32 CallFunc_Array_Length_ReturnValue_4, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_3, bool CallFunc_Greater_IntInt_ReturnValue, class UAGAbilitySystemComponent* K2Node_DynamicCast_AsAGAbility_System_Component_1, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_LessEqual_FloatFloat_ReturnValue, const struct FGameplayTag& Temp_struct_Variable, bool CallFunc_BooleanAND_ReturnValue, int32 Temp_int_Variable, const struct FGameplayTag& K2Node_CustomEvent_OwningTag, int32 K2Node_CustomEvent_Amount);
};

}


