#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x4 (0x4 - 0x0)
// Function WB_NotificationBox.WB_NotificationBox_C.BndEvt__WB_FriendRequestsList_K2Node_ComponentBoundEvent_1_WeHaveSomething__DelegateSignature
struct UWB_NotificationBox_C_BndEvt__WB_FriendRequestsList_K2Node_ComponentBoundEvent_1_WeHaveSomething__DelegateSignature_Params
{
public:
	int32                                        Quantity;                                          // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WB_NotificationBox.WB_NotificationBox_C.Switch Notification Box
struct UWB_NotificationBox_C_Switch_Notification_Box_Params
{
public:
	int32                                        WidgetID;                                          // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WB_NotificationBox.WB_NotificationBox_C.BndEvt__Party_Invites_List_K2Node_ComponentBoundEvent_4_Party_WeHaveSomething__DelegateSignature
struct UWB_NotificationBox_C_BndEvt__Party_Invites_List_K2Node_ComponentBoundEvent_4_Party_WeHaveSomething__DelegateSignature_Params
{
public:
	int32                                        Quantity;                                          // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WB_NotificationBox.WB_NotificationBox_C.BndEvt__Custom_Invites_List_K2Node_ComponentBoundEvent_2_CustomGame_WeHaveSomething__DelegateSignature
struct UWB_NotificationBox_C_BndEvt__Custom_Invites_List_K2Node_ComponentBoundEvent_2_CustomGame_WeHaveSomething__DelegateSignature_Params
{
public:
	int32                                        Quantity;                                          // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x85 (0x85 - 0x0)
// Function WB_NotificationBox.WB_NotificationBox_C.ExecuteUbergraph_WB_NotificationBox
struct UWB_NotificationBox_C_ExecuteUbergraph_WB_NotificationBox_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_728[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable;                                // 0x8(0x18)(None)
	class FText                                  Temp_text_Variable_1;                              // 0x20(0x18)(None)
	class FText                                  Temp_text_Variable_2;                              // 0x38(0x18)(None)
	int32                                        K2Node_ComponentBoundEvent_Quantity_2;             // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        K2Node_CustomEvent_WidgetID;                       // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Variable;                                 // 0x58(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_72A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default;                             // 0x60(0x18)(None)
	int32                                        K2Node_ComponentBoundEvent_Quantity_1;             // 0x78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        K2Node_ComponentBoundEvent_Quantity;               // 0x7C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x80(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchInteger_CmpSuccess;                   // 0x84(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function WB_NotificationBox.WB_NotificationBox_C.Notification_CustomGameRequest_Pop__DelegateSignature
struct UWB_NotificationBox_C_Notification_CustomGameRequest_Pop__DelegateSignature_Params
{
public:
	int32                                        Quantity;                                          // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WB_NotificationBox.WB_NotificationBox_C.Notification_PartyRequest_Pop__DelegateSignature
struct UWB_NotificationBox_C_Notification_PartyRequest_Pop__DelegateSignature_Params
{
public:
	int32                                        Quantity;                                          // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function WB_NotificationBox.WB_NotificationBox_C.Notification_FriendRequest_Pop__DelegateSignature
struct UWB_NotificationBox_C_Notification_FriendRequest_Pop__DelegateSignature_Params
{
public:
	int32                                        Quantity;                                          // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


